{
  "PageType": 0,
  "ColumnCount": 29,
  "RowCount": 44,
  "Formulas": {
    "0,0": "IF(typeFlag=5,\"出库单信息\",\"入库单信息\")",
    "2,0": "CONCATENATE(IF(P2=5,\"CK\",\"RK\"),P3)",
    "4,15": "IF(P2=5,\"新建出库单\",\"新建入库单\")",
    "10,1": "INDEX({\"供应商\",\"入库方\",\"领用人\",\"客户\",\"供应商\",\"出库对象\",\"出库对象\",\"入库方\"},A6)",
    "11,1": "IF(OR(A6=1,A6=4,A6=5),Q12,P12)",
    "11,15": "IF(LEN(P11)=0,\"\",P11)",
    "13,1": "IF(A6=3,\"领用部门\",\"联系人\")",
    "31,15": "TEXTJOIN(\",\",TRUE,P34)",
    "33,19": "IF(P2=5,\"库存下限\",\"库存上限\")",
    "33,20": "IF(P2=5,AB34,AA34)",
    "33,24": "IF(P2=5,X34,W34)",
    "33,25": "V34*Y34",
    "37,0": "SUM(Z34)"
  },
  "CustomNames": [
    {
      "Name": "PageTitle",
      "Formula": "出入库单填写_手机页!$P$5"
    },
    {
      "Name": "selectArray",
      "Formula": "出入库单填写_手机页!$P$32"
    },
    {
      "Name": "typeFlag",
      "Formula": "出入库单填写_手机页!$P$2"
    }
  ]
}