{
  "PageType": 0,
  "ColumnCount": 53,
  "RowCount": 30,
  "Formulas": {
    "1,1": "IF(BA2=5,\"出库单填写\",\"入库单填写\")",
    "4,13": "IF(BA2=5,\"出库类型\",\"入库类型\")",
    "4,26": "IF(BA2=5,\"出库日期\",\"入库日期\")",
    "5,2": "CONCATENATE(IF(BA2=5,\"CK\",\"RK\"),BA19)",
    "6,52": "IF(LEN(BA6)=0,\"\",BA6)",
    "7,2": "IF(OR(N6=1,N6=5),\"供应商\",IF(N6=2,\"入库方\",IF(N6=3,\"领用人\",IF(N6=4,\"客户\",\"出库对象\"))))",
    "7,26": "IF(N6=3,\"领用部门\",\"联系人\")",
    "8,2": "IF(OR(N6=1,N6=4,N6=5),BA9,BA7)",
    "11,40": "SUM(AL19)",
    "15,52": "TEXTJOIN(\",\",TRUE,C19)",
    "17,17": "IF(BA2=5,\"库存下限\",\"库存上限\")",
    "18,17": "IF($BA$2=5,Q19,P19)",
    "18,32": "IF($BA$2=5,AE19,AF19)",
    "18,37": "Z19*AG19"
  }
}